tap "orangekame3/tap"
tap "oven-sh/bun"
tap "vet-run/vet"

# Run your GitHub Actions locally
brew "act"

# Asciicast to GIF converter
brew "agg"

# Catch insensitive, inconsiderate writing
brew "alexjs"

# Record and share terminal sessions
brew "asciinema"

# Aquarium animation in ASCII art
brew "asciiquarium"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"

# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"

# Apjanke's fork of the classic cowsay project
brew "cowsay"

# Utility for casting strings to title-case according to locale-aware style guides
brew "decasify"

# Load/unload environment variables based on $PWD
brew "direnv"

# Pack, ship and run any application as a lightweight container
brew "docker"

# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"

# Isolated development environments using Docker
brew "docker-compose"

# Command-line DNS client
brew "doge"

# Modern, maintained replacement for ls
brew "eza"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Banner-like program prints strings as ASCII art
brew "figlet"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Infamous electronic fortune-cookie generator
brew "fortune"

# Terminal JSON viewer
brew "fx"

# Distributed revision control system
brew "git"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# Pager program similar to more
brew "less"

# Rainbows and unicorns in your console!
brew "lolcat"

# Deep clean and optimize your Mac
brew "mole"

# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# Platform built on V8 to build network applications
brew "node"

# Swiss-army knife of markup format conversion
brew "pandoc"

# Package compiler and linker metadata toolkit
brew "pkgconf"

# Fast, disk space efficient package manager
brew "pnpm"

# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"

# Interpreted, interactive, object-oriented programming language
brew "python"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Utility that provides fast incremental file transfer
brew "rsync"

# Fast, configurable, shell plugin manager
brew "sheldon"

# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"

# Autoformat shell script source code
brew "shfmt"

# Prints a steam locomotive if you type sl instead of ls
brew "sl"

# Human-friendly alternative to netstat for socket and port monitoring
brew "somo"

# Cross-shell prompt for astronauts
brew "starship"

# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"

# Markup-based typesetting system
brew "typst"

# Unpack everything with one command
brew "unp"

# Extremely fast Python package installer and resolver, written in Rust
brew "uv"

# Add declarative schema to .env files using @env-spec decorator comments
brew "varlock"

# Your CLI home video recorder
brew "vhs"

# Internet file retriever
brew "wget"

# Successor of GNU Wget, a file and recursive website downloader
brew "wget2"

# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"

# Paclear is a clear command with PAC-MAN animation
brew "orangekame3/tap/paclear"

# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"

# Command-line tool that acts as a safety net for the risky curl | bash pattern
brew "vet-run/vet/vet-run"

# While casks in general are macOS only. Font casks are generally available.

# Monospaced font with programming ligatures, patched with glyphs
cask "font-fira-code-nerd-font"

# A typeface for developers, patched with glyphs
cask "font-jetbrains-mono-nerd-font"

# Open source monospace font
cask "font-maple-mono"

# See: https://rubydoc.brew.sh/OS.html
if OS.linux?
  # ...
elsif OS.mac?
  # Casks are only supported on macOS

  # Web browser
  cask "firefox"

  # Tool to optimize images to a smaller size
  cask "imageoptim"

  # Terminal emulator as alternative to Apple's Terminal app
  cask "iterm2"

  # JetBrains tools manager
  cask "jetbrains-toolbox"

  # Tool to prevent the system from going into sleep mode
  cask "keepingyouawake"

  # Verify system files structure, run miscellaneous maintenance and more
  cask "onyx"

  # Virtual machines UI using QEMU
  cask "utm"

  # Open-source code editor
  cask "visual-studio-code"

  # Video communication and virtual meeting platform
  cask "zoom"

  # VS Code extensions
  vscode "bierner.github-markdown-preview"
  vscode "bierner.markdown-checkbox"
  vscode "bierner.markdown-emoji"
  vscode "bierner.markdown-footnotes"
  vscode "bierner.markdown-mermaid"
  vscode "bierner.markdown-preview-github-styles"
  vscode "bierner.markdown-yaml-preamble"
  vscode "editorconfig.editorconfig"
  vscode "harrydowning.yaml-embedded-languages"
  vscode "ldez.ignore-files"
  vscode "ms-vscode.makefile-tools"
  vscode "streetsidesoftware.code-spell-checker"
  vscode "tamasfe.even-better-toml"
  vscode "timonwong.shellcheck"
  vscode "xadillax.viml"
end
